app/views/users/index.json.jbuilder

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  json.user_id user.id
  json.number_of_posts user.posts.count