app/views/posts/index.json.jbuilder

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 58]]
---
  json.user_id post.user_id
  json.comment_count post.comments.count