app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test1ees"], ["user_id", 20], ["post_id", 60], ["created_at", "2022-05-01 09:35:08.602284"], ["updated_at", "2022-05-01 09:35:08.602284"]]
---
    def create
        @post  = Post.find_by(id: params[:post_id])
        @user  = Post.find_by(id: params[:user_id])
        if @post.present? && @user.present?
          @comment = @post.comments.create(comment_params.merge(user_id: params[:user_id]))

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]
---
    def destroy
        if @comment.present?
          @comment.destroy

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_comment
        @comment = Comment.find_by(id: params[:id])