app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 20], ["likeable_type", "Post"], ["likeable_id", 60], ["created_at", "2022-05-01 10:33:10.024905"], ["updated_at", "2022-05-01 10:33:10.024905"]]
---
    def like_post
      @post = Post.find_by(id: params[:post_id])
      if @post.present?
        @post.likes << Like.new(user_id: params[:user_id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 20], ["likeable_type", "Comment"], ["likeable_id", 1], ["created_at", "2022-05-01 10:40:06.718569"], ["updated_at", "2022-05-01 10:40:06.718569"]]
---
    def like_comment
        @comment = Comment.find_by(id: params[:comment_id])
        if @comment.present?
          @comment.likes << Like.new(user_id: params[:user_id])