app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58, $59, $60)
SELECT "posts".* FROM "posts"
---
    def index
      user = User.find_by(id: params[:user_id])
      if user.present?
        @posts = user.posts.includes(:comments)

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["content", "content test"], ["user_id", 40], ["created_at", "2022-05-01 07:26:36.870834"], ["updated_at", "2022-05-01 07:26:36.870834"]]
---
    def create
        @post = Post.new(post_params)
        result = {json: @post.save ? @post : @post.errors}

UPDATE "posts" SET "title" = $1, "content" = $2, "user_id" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "test1ees"], ["content", "content tests"], ["user_id", 3], ["updated_at", "2022-05-01 15:38:02.002207"], ["id", 14]]
---
    def update
        result = {json:  @post.update(post_params) ? @post : @post.errors}

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 123]]
---
    def destroy
        if  @post.present?
          @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 141], ["LIMIT", 1]]
---
    def set_post
        @post = Post.find_by(id: params[:id])