app/controllers/users_controller.rb

    def index
      @users  = User.all.includes(:posts)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20)
SELECT "users".* FROM "users"

    def create
        user = User.create(user_params)
        result = {json: user.save ? user : user.errors}
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test1"], ["email", "email.rt@gmail.com"], ["password", "[FILTERED]"], ["created_at", "2022-05-01 07:32:41.194102"], ["updated_at", "2022-05-01 07:32:41.194102"]]
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test21"], ["email", "email2.rt@gmail.com"], ["password", "[FILTERED]"], ["created_at", "2022-05-01 07:37:06.644281"], ["updated_at", "2022-05-01 07:37:06.644281"]]

    def destroy
        if  @user.present?
          @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 40]]

    def set_user
      @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]